tutorials/surfaceTracking/interTrackFoam/tank3D/constant/faMesh/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// ************************************************************************** //

polyMeshPatches  1( freeSurface );

boundary
{
    symm-1
    {
        type                symmetryPlane;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  symm-1;
    }

    symm-2
    {
        type                symmetryPlane;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  symm-2;
    }

    side-1
    {
        type                patch;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  side-1;
    }

    side-2
    {
        type                patch;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  side-2;
    }
}


// ************************************************************************** //
